// **Итоговая проверочная работа**  
// Написать программу, которая из имеющегося массива строк формирует массив из строк, длина которых меньше либо равна 3 символа. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.  

// Примеры:  
// ["hello","2","world",";-)"] -> ["2",":-)"]  
// ["1,2,3,4","1567","-2","computer science"] -> ["-2"]  
// ["Rissia","Denmark","Kazan"] ->[ ]  

// Некоторые условности:
// 1. Допускаем, что пользователь вводит число при запросе длины базового массива. Т.е. обработчик ошибок не пишем
// 2. Длинна копируемого элемента указана в коде явно, что соответствует условию ТЗ.
